DeatakCZ/STM32/StandAlone/G030K6/06_LED-MOSFET-Driver_Controller_Hello-World/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define POT_4_Pin GPIO_PIN_0
#define POT_4_GPIO_Port GPIOA
#define POT_3_Pin GPIO_PIN_1
#define POT_3_GPIO_Port GPIOA
#define POT_2_Pin GPIO_PIN_2
#define POT_2_GPIO_Port GPIOA
#define POT_1_Pin GPIO_PIN_3
#define POT_1_GPIO_Port GPIOA
#define LM35_Pin GPIO_PIN_4
#define LM35_GPIO_Port GPIOA
#define Therm_ref_Pin GPIO_PIN_5
#define Therm_ref_GPIO_Port GPIOA
#define Therm_4_Pin GPIO_PIN_6
#define Therm_4_GPIO_Port GPIOA
#define Therm_3_Pin GPIO_PIN_7
#define Therm_3_GPIO_Port GPIOA
#define Therm_2_Pin GPIO_PIN_0
#define Therm_2_GPIO_Port GPIOB
#define Therm_1_Pin GPIO_PIN_1
#define Therm_1_GPIO_Port GPIOB
#define PWM_4_Pin GPIO_PIN_8
#define PWM_4_GPIO_Port GPIOA
#define PWM_3_Pin GPIO_PIN_9
#define PWM_3_GPIO_Port GPIOA
#define DEBUG_1_Pin GPIO_PIN_6
#define DEBUG_1_GPIO_Port GPIOC
#define PWM_2_Pin GPIO_PIN_10
#define PWM_2_GPIO_Port GPIOA
#define PWM_1_Pin GPIO_PIN_11
#define PWM_1_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
